task4/Case folder/Re50/Re50_500_80/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
( 
 (-50 -16 0)
 (-2 -16 0)
 (2 -16 0)
 (150 -16 0)
 (150 -2 0)
 (150 2 0)
 (150 16 0)
 (2 16 0)
 (-2 16 0)
 (-50 16 0)
 (-50 2 0)
 (-50 -2 0)
 (-2 -2 0)
 (2 -2 0)
 (2 2 0)
 (-2 2 0)
 (-50 -16 1)
 (-2 -16 1)
 (2 -16 1)
 (150 -16 1)
 (150 -2 1)
 (150 2 1)
 (150 16 1)
 (2 16 1)
 (-2 16 1)
 (-50 16 1)
 (-50 2 1)
 (-50 -2 1)
 (-2 -2 1)
 (2 -2 1)
 (2 2 1)
 (-2 2 1)
);

blocks
(
hex (2 13 12 1 18 29 28 17) (28 24 1) simpleGrading (0.2 1 1)
hex (3 4 13 2 19 20 29 18) (28 363 1) simpleGrading (0.2 0.2 1)
hex (4 5 14 13 20 21 30 29) (24 363 1) simpleGrading (1 0.2 1)
hex (5 6 7 14 21 22 23 30) (28 363 1) simpleGrading (5 0.2 1)
hex (14 7 8 15 30 23 24 31) (28 24 1) simpleGrading (5 1 1)
hex (15 8 9 10 31 24 25 26) (28 113 1) simpleGrading (5 5 1)
hex (12 15 10 11 28 31 26 27) (24 113 1) simpleGrading (1 5 1)
hex (1 12 11 0 17 28 27 16) (28 113 1) simpleGrading (0.2 5 1)
);

edges
(
);

boundary
(
    inlet
    {
        type wall;
        faces
        (
            (10 9 25 26)
			(11 10 26 27 )
			(0 11 27 16 )
        );
    }
    
    outlet
    {
        type wall;
        faces
        (
            (6 5 21 22)
			(5 21 20 4)
			(4 3 19 20)
        );
    }
    
    top
    {
        type wall;
        faces
        (
            (9 8 24 25)
			(8 7 23 24)
			(7 6 22 23)
        );
    }
    
    bottom
    {
        type wall;
        faces
        (
            (1 0 16 17)
			(1 17 18 2)
			(3 2 18 19)
        );
    }
    
    cylinder
    {
        type wall;
        faces
        (
            (15 31 30 14)
			(30 14 13 29)
			(12 13 29 28)
			(31 15 12 28)
        );
    }
    
  /*  sides
    {
        type empty;
        faces
        (
            (10 15 8 9)
(15 14 7 8)
(14 5 6 7)
(11 12 15 10)
(12 13 14 15)
(13 4 5 14)
(0 1 12 11)
(1 2 13 12)
(2 3 4 13)
(26 31 24 25)
(31 24 30 23)
(30 21 22 23)
(27 28 31 26)
(28 31 30 29)
(29 20 21 30)
(16 17 28 27)
(17 18 29 28)
(18 19 20 29)
);
    }
*/

);

mergePatchPairs
(
);

// ************************************************************************* //
