task4/Case folder/Re50/Re50_500_80/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       77580;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       77660;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          500;
        startFace       77740;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          490;
        startFace       78240;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       78730;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          78200;
        startFace       78820;
    }
)

// ************************************************************************* //
